use Продажи2
create table STUDENT2
( [Номер зачётки] int identity(1,3) not null,
ФИО varchar(100) not null,
[Дата рождения] date not null,
Пол nchar(1) default 'м' check(Пол in ('м', 'ж')),
[Дата поступления] date not null)

insert into STUDENT2
values ('Карпушевич Оксана Васильевна', '2000-12-15', 'ж', '2018-09-01'),
('Рогалевич Вероника Сергеевна', '2001-05-12', 'ж', '2018-09-01'),
('Костюков Анна Анатольевна', '2001-02-17', 'ж', '2018-09-01'),
('Кремень Денис Русланович', '2000-08-4', 'м', '2018-09-01'),
('Заболотная Анна Олеговна', '2000-02-23', 'ж', '2018-09-01'),
('Кондратович Виктория Максимовна', '1999-12-16', 'ж', '2018-09-01'),
('Ковалёва Ирина Павловна', '1999-08-18', 'ж', '2018-09-01');

insert into STUDENT2
values ('Борисов Антон Валерьевич', '2001-01-03', 'м', '2018-09-01'),
('Невар  Юлия Владимировна','2001-01-10','ж','2018-09-01');

SELECT ФИО, [Дата рождения], DATEDIFF([MONTH], [Дата рождения],[Дата поступления])/12 as Возраст 
From STUDENT2
Where  DATEDIFF([MONTH], [Дата рождения],[Дата поступления])/12 >= 18 and Пол = 'ж'

SELECT * FROM STUDENT2